#ifndef __CompileErrors__
#define __CompileErrors__

#include <vector>
#include <iostream>
#include <sstream>
#include <fstream>
#include <string>
using namespace std;

#include "Exception.h"

//==============================================================================
// обработчик ошибок компиляции
//==============================================================================
class CompileErrors
{
protected:
	// общее число ошибок компиляции
	unsigned int num;
	// список сообщений об ошибках
	//vector<string> list;
	char** list;
	// поток, в который будут выводится сообщения об ошибках
	// (в конструкторе класса объявлен стандартный поток вывода)
	ostream &out;
	// Число сообщений об ошибках
	int size;

public:
	//==========================================================================
	// конструктор
	//--------------------------------------------------------------------------
	// filename - [in] имя файла с текстом сообщений об ошибках
	//==========================================================================
	//CompileErrors(string filename);

	CompileErrors();

	//==========================================================================
	// деструктор
	//==========================================================================
	virtual ~CompileErrors() {}

	//==========================================================================
	// возвращает количество ошибок компиляции
	//==========================================================================
	unsigned int GetNum() { return num; }

	//==========================================================================
	// обнуляет число ошибок и очищает поток вывода
	//==========================================================================
	void Clear()
	{
		num = 0;
	}

	//==========================================================================
	// выводит сообщение об ошибке
	//--------------------------------------------------------------------------
	// Str - [in] строка с ошибкой
	// Col - [in] столбец
	// n   - [in] номер сообщения об ошибке
	//==========================================================================
    void Message(unsigned int Str, unsigned int Col, int n);

	//==========================================================================
	// выводит сообщение об ошибке
	//--------------------------------------------------------------------------
	// message   - [in] текст ошибки
	//==========================================================================
	void Message(string message) {
		out << message << endl;
		++num;
	}
};

#endif
